Revit 2024 API
BuiltInFailures.RevisionCloudFailures.ProhibitSwitchToIssuedRevision Property
 Can't add cloud to an Issued Revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ProhibitSwitchToIssuedRevision { get; }
Visual Basic
Public Shared ReadOnly Property ProhibitSwitchToIssuedRevision As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ProhibitSwitchToIssuedRevision {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace